Repository: OguzhanC07/oguzhancan-site
Catalog: src/OguzhanCan.Website/Resources/PortfolioTexts.*.resx
Languages: tr_tr

# AboutMe_Title
source: About Me
tr_tr: Hakkımda

# AboutMe_Description
source: I'm a developer specialized in building integrated and scalable solutions tailored to enterprise needs using MSSQL, .NET, and the Microsoft Power Platform (Dynamics 365, Power Automate, Power Apps, Power Pages). I deliver high value by digitizing end-to-end business processes, particularly in CRM and workflow automation projects.
tr_tr: MSSQL, .NET ve Microsoft Power Platform (Dynamics 365, Power Automate, Power Apps, Power Pages) teknolojileriyle çalışan, kurumsal ihtiyaçlara yönelik entegre ve ölçeklenebilir çözümler geliştirme konusunda uzman bir geliştiriciyim. Uçtan uca iş süreçlerini dijitalleştirerek, özellikle CRM ve iş akışı otomasyon projelerinde yüksek katma değer sağlıyorum.

# Projects_Description_1
source: I developed and continue to enhance LC Waikiki's CRM Retail Service, a fully integrated, multi-channel campaign management system used across Turkey and international markets.
tr_tr: LC Waikiki’nin Türkiye ve yurt dışı operasyonlarında kullanılan, tam entegre ve çok kanallı kampanya yönetim sistemi olan CRM Retail Service’i geliştirdim ve aktif olarak iyileştirmeye devam ediyorum. Sistem; web, mobil ve mağaza kanallarında uçtan uca kampanya süreçlerini merkezi olarak yönetebilecek şekilde tasarlanmıştır.

# Projects_Title_2
source: Boyner Microsoft Dynamics Crm Project
tr_tr: Boyner Microsoft Dynamics Crm Projesi

# Projects_Description_2
source: I developed an integrated solution for customer permission management and deduplication, enhancing data accuracy and compliance across Boyner’s e-commerce, retail, and mobile platforms.
tr_tr: Boyner’in e-ticaret, mağaza ve mobil platformlarında veri doğruluğunu ve uyumluluğu artıran, izin yönetimi ve müşteri tekilleştirme süreçlerini kapsayan entegre bir çözüm geliştirdim.

# Mario_WelcomeText
source: Welcome!
tr_tr: Hoşgeldin!

# Mario_WelcomeDescription
source: <p>Hello! I'm <strong>Oguzhan Can</strong>, a passionate developer ready to take on new challenges!</p><p>Move Mario to the right to start exploring my professional journey!</p>
tr_tr: <p>Merhaba! Ben <strong>Oğuzhan Can</strong>, yeni zorlukların üstesinden gelmeye hazır, tutkulu bir geliştiriciyim!</p><p>Profesyonel yolculuğumu keşfetmeye başlamak için Mario'yu sağa kaydırın!</p>

# Mario_AboutMe_Title
source: 👨‍💻 About Me
tr_tr: 👨‍💻 Hakkımda

# Mario_AboutMe_Description
source: <p><strong>Location:</strong> Mushroom Kingdom (Remote)</p><p><strong>Email:</strong><a href='mailto:hello@oguzhancan.com'>hello@oguzhancan.com</a></p><p><strong>Experience:</strong> {0}+ years in various technologies such as Power Platform, .Net, MSSQL</p><p>I'm a passionate developer who loves creating interactive experiences and solving complex problems. Just like Mario collects coins, I collect new skills and technologies!</p>
tr_tr: <p><strong>Konum:</strong> Mantar Krallığı (Uzaktan)</p><p><strong>E-posta:</strong> <a href='mailto:hello@oguzhancan.com'>hello@oguzhancan.com</a></p><p><strong>Deneyim:</strong> {0}+ yıl boyunca Power Platform, .NET, MSSQL gibi çeşitli teknolojilerle çalıştım</p><p>İnteraktif deneyimler geliştirmeyi ve karmaşık problemleri çözmeyi seven tutkulu bir geliştiriciyim. Mario nasıl altın topluyorsa, ben de yeni yetkinlikler ve teknolojiler keşfetmeyi seviyorum!</p>

# Mario_Recent_Projects_Title_1
source: Setur Customer Service Project
tr_tr: Setur Müşteri Hizmetleri Projesi

# Mario_Recent_Projects_Description_1
source: Developed the CRM Customer Service module for Setur, streamlining support processes and ensuring consistent, efficient customer interactions across all channels.
tr_tr: Setur için CRM Müşteri Hizmetleri modülünü geliştirdim; müşteri destek süreçlerini sadeleştirerek tüm kanallarda tutarlı ve verimli iletişim sağladım.

# Mario_Recent_Projects_Title_2
source: Koçzer Customer Service And Sales and Marketing Project
tr_tr: Koçzer Müşteri Hizmetleri ve Satış ve Marketing Projesi

# Mario_Recent_Projects_Description_2
source: I developed solutions for Koçzer in the areas of permission management, sales, and customer service. I optimized permission submission and retrieval processes, enhanced customer service management, and designed a customized sales system for Koçzer, improving overall business efficiency.
tr_tr: Koçzer için izin yönetimi, satış ve müşteri hizmetleri alanlarında çözümler geliştirdim. İzin gönderme ve alma süreçlerini optimize ettim, müşteri hizmetleri yönetimini geliştirdim ve Koçzer için özelleştirilmiş bir satış sistemi tasarlayarak genel iş verimliliğini artırdım.

# Mario_RecentProjects_Title
source: 🌟 Recent Projects
tr_tr: 🌟 Son Yaptığım Projeler

# Mario_Blog_Title
source: 📝 Blog & Writing
tr_tr: 📝 Blog

# Mario_Blog_Description
source: <p><strong>Coming Soon!</strong> 🚧</p>
tr_tr: <p><strong>Yakında!</strong> 🚧</p>

# Mario_Connect_Title
source: 🎯 Let's Connect!
tr_tr: 🎯 Bağlantı Kuralım!

# Mario_Connect_Description
source: <p><strong>Ready to work together?</strong></p><p>I'm always excited to take on new challenges and collaborate on innovative projects!</p><p><strong>Contact:</strong><a href="mailto:hello@oguzhancan.com">hello@oguzhancan.com</a></p><p><strong>LinkedIn:</strong> <a href="https://www.linkedin.com/in/oguzhan-can/"> /in/oguzhan-can/</a></p><p><strong>GitHub:</strong> <a href="https://github.com/OguzhanC07"> /OguzhanC07</a> </p><p>Thanks for exploring my journey! 🎮✨</p>
tr_tr: <p><strong>Birlikte çalışmaya hazır mısınız?</strong></p> <p>Her yeni proje ve yenilikçi fikir için heyecan duyuyorum—gelin birlikte harika işler çıkaralım!</p> <p><strong>İletişim:</strong> <a href="mailto:hello@oguzhancan.com">hello@oguzhancan.com</a></p> <p><strong>LinkedIn:</strong> <a href="https://www.linkedin.com/in/oguzhan-can/">/in/oguzhan-can/</a></p> <p><strong>GitHub:</strong> <a href="https://github.com/OguzhanC07">/OguzhanC07</a></p> <p>Yolculuğuma göz attığınız için teşekkürler! 🎮✨</p>

# Mario_Work_Experience_1
source: Lead development of scalable applications, mentor junior developers, implement modern practices.
tr_tr: Ölçeklenebilir uygulamaların geliştirilmesine liderlik ediyor, junior geliştiricilere mentorluk yapıyor ve modern yazılım geliştirme yaklaşımlarını uyguluyorum.

# Mario_WorkExperience_Present
source: Present
tr_tr: Günümüz

# Mario_Work_Experience_2
source: I developed over 2,000 automated UI tests for the FileOrbis system using the .NET framework, also created load tests for fileorbis system.
tr_tr: FileOrbis sistemi için .NET Framework ile 2.000'den fazla otomatik UI testi geliştirdim; ayrıca sistemin performansını ölçmek için yük testleri oluşturdum.

# Mario_Skills_Title
source: 🛠️ Skills & Technologies
tr_tr: 🛠️ Yetenekler ve Teknolojiler

# Mario_Skills_ToolsAndOthers
source: Tools & Others
tr_tr: Araçlar ve Diğer

# Mario_Progress_StartJourney
source: Start Journey
tr_tr: Yolculuğa Başla

# Mario_Progress_GettingStarted
source: Getting Started
tr_tr: Başlarken

# Mario_Progress_LearnMore
source: Learning More
tr_tr: Daha Fazlasını Öğrenin

# Mario_Progress_ExploreProjects
source: Exploring Projects
tr_tr: Projeler Keşfediliyor

# Mario_Progress_AlmostDone
source: Almost Done
tr_tr: Nerdeyse Tamamlandı

# Mario_Progress_JourneyComplete
source: Journey Complete!
tr_tr: Yolculuk Tamamlandı!

# Mario_Controls_Description
source: Use ← → arrow keys or click to move Mario!<br>Press SPACE or ↑ to jump!<br>Move right to discover more about me!<br><small>Or use virtual controls below!</small><a href="/classic" style="color: white;"> Go To Classic Version</a>
tr_tr: ← → ok tuşlarıyla veya tıklayarak Mario'yu hareket ettirebilirsin!<br>Zıplamak için BOŞLUK tuşunu ya da ↑ tuşunu kullan!<br>Hakkımda daha fazlasını keşfetmek için sağa doğru ilerle!<br><small>Ya da aşağıdaki sanal kontrol tuşlarını kullanabilirsin!</small><a href="/classic" style="color: white;">Klasik Versiyona Git</a>
